views/layouts/footer.php

SELECT * FROM `empresa` WHERE `emp_id`=1
---
 ?>

<?php
    $emp=Empresa::findOne(1);