controllers/EmpresaController.php

SELECT * FROM `empresa` WHERE `emp_id`=1
INSERT INTO `empresa` (`emp_nombre`, `emp_num_cel`, `emp_num_tel`, `emp_mail`, `emp_galeria`, `emp_nosotros`) VALUES ('lkjkjho87', 987, 987, '987', :qp4, '987')
---
    public function actionCreate()
    {

        $model = new Empresa();
        if ($model->load(Yii::$app->request->post())) {
            $emp_galeria = UploadedFile::getInstances($model, 'emp_galeria');
            $model->emp_galeria=null;
            print_r($model->getErrors());
            echo "<br>";
            $model->save();

SELECT * FROM `empresa` WHERE `emp_id`=1
---
    public function actionHome()
    {
        $id=1;
        return $this->render('home', [
            'empresa' => Empresa::findOne($id),
            'servicio' => Empresa::findOne($id)->getRelation('servicios')->where(['not in','ser_servicio','electronica'])->all(),
        ]);